mobile/controllers/MembersController.php

SELECT * FROM `wxpayrecord` WHERE (`mid`='15668') AND (`pay_type`='feeuser') ORDER BY `created` DESC
---
        //粉丝 查找to_mid
        $fans = $model->find()->asarray()->with('fans')->where(['to_mid'=>$member_id])->count();
        //判断是否是付费会员
        $feeuserStatus = Wxpayrecord::find()->asarray()->where(['mid'=>$member_id,'pay_type'=>'feeuser'])->orderBy('created DESC')->all();